{
    "introHeader": "Hello, I'm Fernando L. Maioli",
    "introText": "I'm a Brazilian Software Engineer holding a bachelor's degree from PUCRS. I've worked at multiple projects over the years, primarily in mobile development. I have always enjoyed working on a team and often took the role of Scrum Master or Manager. I have a strong curiosity and enjoy learning new things while embracing challenges. I'm proficient in both Portuguese and English.",
    "careerHeader": "Career",
    "careerExperiences": [
        {
            "date": "May 2019 - Present",
            "name": "Graphi",
            "link": "https://www.instagram.com/graphi_app/",
            "description": "Graphi is a Startup that originated within Apple Developer Academy, with the vision to develop a tool for pediatricians to use in their appointments. The application does all the necessary calculations and presents visually intuitive graphics, assisting the medical practitioners in their work. Subsequent to the Apple Developer Academy course, Graphi transitioned to the Bay Bridge project as part of TECNOPUC Startups to continue its development and growth. During development cycles, I assumed roles of iOS developer and Scrum Master, employing technologies such as Swift, SwiftUI, Firebase Analytics and Fastlane."
        },
        {
            "date": "February 2021 - April 2022",
            "name": "Nelogica",
            "link": "https://www.nelogica.com.br/",
            "description": "I was involved in the development of Vector iOS, an application designed to facilitate analyzing and trading cryptocurrencies. I learned a lot during this experience, particularly because I had the chance to work on areas such as code maintenance, systems refactoring and development of new features. Among the technologies employed during development were Swift, SwiftUI, Firebase Analytics and Jira."
        },
        {
            "date": "February 2019 - December 2020",
            "name": "Apple Developer Academy",
            "link": "https://developeracademy.eldorado.org.br/poa/",
            "description": "I had the privilege of participating in this scholarship/internship program jointly created by Apple, PUCRS and Instituto Eldorado. The program aims to foster the learning of its participants by encouraging the development of innovative applications and solutions through Apple technologies, while also employing UX design methodologies and agile approaches. Within the program I developed multiple applications, including noteworthy examples Graphi and Mindland."
        },
        {
            "date": "October 2018 - February 2019",
            "name": "LIS - HP",
            "link": "https://www.politecnica.pucrs.br/laboratorios/lis/",
            "description": "During this internship, I worked on the development of an Artificial Intelligence capable of detecting and identifying text within images and videos. The AI was built utilizing a Deep Neural Network and trained through Machine Learning techniques, using Python programming language and the SKLearn library."
        }
    ],
    "educationHeader": "Education",
    "educationExperiences": [
        {
            "date": "January 2017 - Agust 2021",
            "name": "Software Engineering bachelor's degree",
            "description": "I successfully completed my undergraduate studies in Software Engineering at Pontifícia Universidade Católica do Rio Grande do Sul (PUCRS), where I acquired knowledge on all the processes used in software development. Throughout my academic journey, I participated in several extracurricular activities, where I could apply and reinforce my learnings. Additionally,  I sought internships as soon as possible, which allowed me to start accumulating experience."
        },
        {
            "date": "January 2014 - December 2016",
            "name": "Highschool",
            "description": "During my high school years I attended the Scalabriniano São José School, where I learned the fundamentals of essential academic disciplines and prepared for college."
        }
    ],
    "projectsHeader": "Projects",
    "projects": [
        {
            "name": "MindLand",
            "date": "October 2019 - November 2020",
            "description": "Mindland is an exemplary project that happened within Apple Developer Academy, which aimed to teach the fundamentals of computational thinking to children using techniques storytelling and gamification. Aside from programming, I also helped in creating the mini-games added to the solution and was responsible for ensuring quality of code. The programming language used was Swift.",
            "link": "https://apps.apple.com/us/app/mindland/id1484998648",
            "image": "images/Mindland-showcase.png",
            "linkHTML": "<img src='images/download-app-store.png' class='store-button' alt='App Store'>"
        },
        {
            "name": "Radar do Investidor",
            "date": "March 2021 - June 2021",
            "description": "Radar do Investidor (Investor Radar) was a significant component of my final paper during my undergraduate studies at PUCRS. The project was owned by the investment and technology company Warren, the idea was to create a website were investors could search, analyze and compare investment funds. The front-end was developed in TypeScript with ReactJS and NextJS, while the back-end functioned as a RESTful API developed using TypeScript with NodeJS, and the chosen database management system was PostgresSQL. My role in this was that of full-stack developer alongside managerial responsibilities.",
            "link": "https://tools.ages.pucrs.br/radar-do-investidor/radardoinvestidor-wiki/-/wikis/home",
            "image": "images/Radar-Investimento-showscase.png",
            "linkHTML": "Wiki"
        }
    ]
}